详情结果/原始结果/redis_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:redis-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/redis/conf:/home/YCSB/redis/target/redis-binding-0.15.0.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/redis/clients/jedis/2.9.0/jedis-2.9.0.jar:/root/.m2/repository/org/apache/commons/commons-pool2/2.4.2/commons-pool2-2.4.2.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=192.168.4.134 -p redis.port=6379 -p redis.password=moonlight -threads 100 -load
Command line: -db com.yahoo.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=192.168.4.134 -p redis.port=6379 -p redis.password=moonlight -threads 100 -load
YCSB Client 0.15.0

Loading workload...
Starting test.
2018-12-28 15:24:06:691 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-28 15:24:16:655 10 sec: 80572 operations; 8056.39 current ops/sec; est completion in 20 minutes [INSERT: Count=80577, Max=21919, Min=959, Avg=12297.99, 90=13111, 99=14967, 99.9=17567, 99.99=20383] 
2018-12-28 15:24:26:655 20 sec: 159305 operations; 7873.3 current ops/sec; est completion in 20 minutes [INSERT: Count=78730, Max=19295, Min=2128, Avg=12698.82, 90=13711, 99=16127, 99.9=17727, 99.99=18687] 
2018-12-28 15:24:36:655 30 sec: 238433 operations; 7912.8 current ops/sec; est completion in 20 minutes [INSERT: Count=79128, Max=18559, Min=9576, Avg=12634.84, 90=13575, 99=14935, 99.9=16591, 99.99=17759] 
2018-12-28 15:24:46:655 40 sec: 316180 operations; 7774.7 current ops/sec; est completion in 20 minutes [INSERT: Count=77749, Max=17039, Min=4272, Avg=12860.15, 90=13623, 99=15271, 99.9=16343, 99.99=16815] 
2018-12-28 15:24:56:655 50 sec: 394384 operations; 7820.4 current ops/sec; est completion in 20 minutes [INSERT: Count=78202, Max=17551, Min=3712, Avg=12786.27, 90=13335, 99=14079, 99.9=15511, 99.99=16719] 
2018-12-28 15:25:06:655 60 sec: 476336 operations; 8195.2 current ops/sec; est completion in 20 minutes [INSERT: Count=81953, Max=17391, Min=3708, Avg=12200.04, 90=13015, 99=14127, 99.9=16023, 99.99=16863] 
2018-12-28 15:25:16:655 70 sec: 551642 operations; 7530.6 current ops/sec; est completion in 19 minutes [INSERT: Count=75308, Max=151295, Min=6388, Avg=13275.78, 90=14351, 99=36095, 99.9=101183, 99.99=132607] 
2018-12-28 15:25:26:655 80 sec: 629880 operations; 7823.8 current ops/sec; est completion in 19 minutes [INSERT: Count=78233, Max=42495, Min=6428, Avg=12781.97, 90=13959, 99=16671, 99.9=38879, 99.99=41279] 
2018-12-28 15:25:36:655 90 sec: 713642 operations; 8376.2 current ops/sec; est completion in 19 minutes [INSERT: Count=83763, Max=16543, Min=7812, Avg=11937.49, 90=12943, 99=13951, 99.9=15199, 99.99=16071] 
2018-12-28 15:25:46:655 100 sec: 796332 operations; 8269 current ops/sec; est completion in 19 minutes [INSERT: Count=82689, Max=17167, Min=6624, Avg=12091.38, 90=12679, 99=13327, 99.9=15391, 99.99=16431] 
2018-12-28 15:25:56:657 110 sec: 879227 operations; 8289.5 current ops/sec; est completion in 19 minutes [INSERT: Count=82896, Max=15655, Min=5604, Avg=12063.92, 90=12639, 99=13287, 99.9=14407, 99.99=15367] 
2018-12-28 15:26:06:655 120 sec: 962758 operations; 8353.1 current ops/sec; est completion in 18 minutes [INSERT: Count=83535, Max=17439, Min=7060, Avg=11967.42, 90=12767, 99=13879, 99.9=15615, 99.99=16639] 
2018-12-28 15:26:16:655 130 sec: 1045521 operations; 8276.3 current ops/sec; est completion in 18 minutes [INSERT: Count=82764, Max=16863, Min=9552, Avg=12080.61, 90=12807, 99=13695, 99.9=14959, 99.99=15951] 
2018-12-28 15:26:26:655 140 sec: 1120264 operations; 7474.3 current ops/sec; est completion in 18 minutes [INSERT: Count=74742, Max=239999, Min=9264, Avg=13376.48, 90=15927, 99=37727, 99.9=136063, 99.99=192383] 
2018-12-28 15:26:36:655 150 sec: 1195582 operations; 7531.8 current ops/sec; est completion in 18 minutes [INSERT: Count=75313, Max=42623, Min=8068, Avg=13277.12, 90=14919, 99=34591, 99.9=40575, 99.99=41631] 
2018-12-28 15:26:46:655 160 sec: 1275232 operations; 7965 current ops/sec; est completion in 18 minutes [INSERT: Count=79650, Max=43295, Min=9624, Avg=12553.26, 90=14431, 99=28927, 99.9=40447, 99.99=42399] 
2018-12-28 15:26:56:655 170 sec: 1357387 operations; 8215.5 current ops/sec; est completion in 18 minutes [INSERT: Count=82156, Max=15007, Min=8152, Avg=12170.16, 90=12855, 99=13695, 99.9=14359, 99.99=14879] 
2018-12-28 15:27:06:655 180 sec: 1442438 operations; 8505.1 current ops/sec; est completion in 17 minutes [INSERT: Count=85053, Max=17567, Min=8960, Avg=11756.34, 90=12679, 99=13719, 99.9=15551, 99.99=16575] 
2018-12-28 15:27:16:655 190 sec: 1520483 operations; 7804.5 current ops/sec; est completion in 17 minutes [INSERT: Count=78045, Max=19247, Min=4944, Avg=12811.23, 90=15607, 99=16831, 99.9=17823, 99.99=18735] 
2018-12-28 15:27:26:655 200 sec: 1599739 operations; 7925.6 current ops/sec; est completion in 17 minutes [INSERT: Count=79253, Max=20591, Min=8728, Avg=12615.64, 90=13655, 99=15623, 99.9=17567, 99.99=19919] 
2018-12-28 15:27:36:655 210 sec: 1679991 operations; 8025.2 current ops/sec; est completion in 17 minutes [INSERT: Count=80255, Max=18159, Min=7180, Avg=12458.22, 90=13279, 99=14295, 99.9=15847, 99.99=17023] 
2018-12-28 15:27:46:655 220 sec: 1754753 operations; 7476.2 current ops/sec; est completion in 17 minutes [INSERT: Count=74759, Max=253439, Min=9160, Avg=13373.79, 90=14231, 99=37375, 99.9=158463, 99.99=226559] 
2018-12-28 15:27:56:655 230 sec: 1834339 operations; 7958.6 current ops/sec; est completion in 17 minutes [INSERT: Count=79591, Max=47519, Min=6964, Avg=12563.94, 90=13719, 99=36319, 99.9=45279, 99.99=46879] 
2018-12-28 15:28:06:655 240 sec: 1907754 operations; 7341.5 current ops/sec; est completion in 16 minutes [INSERT: Count=73413, Max=44543, Min=9768, Avg=13620.78, 90=15567, 99=35455, 99.9=41791, 99.99=42719] 
2018-12-28 15:28:16:655 250 sec: 1976644 operations; 6889 current ops/sec; est completion in 16 minutes [INSERT: Count=68890, Max=44223, Min=9696, Avg=14511.99, 90=16031, 99=36543, 99.9=42271, 99.99=43839] 
2018-12-28 15:28:26:655 260 sec: 2048286 operations; 7164.2 current ops/sec; est completion in 16 minutes [INSERT: Count=71641, Max=43583, Min=9952, Avg=13958.66, 90=15695, 99=34815, 99.9=42207, 99.99=43263] 
2018-12-28 15:28:36:655 270 sec: 2131539 operations; 8325.3 current ops/sec; est completion in 16 minutes [INSERT: Count=83252, Max=20959, Min=9352, Avg=12009.23, 90=13463, 99=15359, 99.9=17551, 99.99=18991] 
2018-12-28 15:28:46:655 280 sec: 2206215 operations; 7467.6 current ops/sec; est completion in 16 minutes [INSERT: Count=74678, Max=17391, Min=9912, Avg=13389.55, 90=14703, 99=15991, 99.9=16671, 99.99=17151] 
2018-12-28 15:28:56:655 290 sec: 2281339 operations; 7512.4 current ops/sec; est completion in 16 minutes [INSERT: Count=75124, Max=20271, Min=4252, Avg=13309.81, 90=14751, 99=16359, 99.9=18015, 99.99=19583] 
2018-12-28 15:29:06:655 300 sec: 2358068 operations; 7672.9 current ops/sec; est completion in 16 minutes [INSERT: Count=76730, Max=18639, Min=7220, Avg=13032.05, 90=13919, 99=15343, 99.9=16735, 99.99=17999] 
2018-12-28 15:29:16:655 310 sec: 2435079 operations; 7701.1 current ops/sec; est completion in 16 minutes [INSERT: Count=77011, Max=16735, Min=5140, Avg=12982.34, 90=13687, 99=14455, 99.9=15439, 99.99=16431] 
2018-12-28 15:29:26:655 320 sec: 2503854 operations; 6877.5 current ops/sec; est completion in 15 minutes [INSERT: Count=68774, Max=335359, Min=6596, Avg=14538.93, 90=15463, 99=46527, 99.9=216959, 99.99=271103] 
2018-12-28 15:29:36:655 330 sec: 2565401 operations; 6154.7 current ops/sec; est completion in 15 minutes [INSERT: Count=61544, Max=50079, Min=7456, Avg=16239.8, 90=17599, 99=42911, 99.9=48191, 99.99=49407] 
2018-12-28 15:29:46:655 340 sec: 2631428 operations; 6602.7 current ops/sec; est completion in 15 minutes [INSERT: Count=66029, Max=48991, Min=5260, Avg=15148.59, 90=16231, 99=40767, 99.9=46847, 99.99=48479] 
2018-12-28 15:29:56:655 350 sec: 2703600 operations; 7217.2 current ops/sec; est completion in 15 minutes [INSERT: Count=72170, Max=43167, Min=9664, Avg=13854.7, 90=16327, 99=34751, 99.9=41151, 99.99=42847] 
2018-12-28 15:30:06:655 360 sec: 2782628 operations; 7902.8 current ops/sec; est completion in 15 minutes [INSERT: Count=79030, Max=41055, Min=9360, Avg=12652.89, 90=13943, 99=33055, 99.9=39583, 99.99=40863] 
2018-12-28 15:30:16:655 370 sec: 2860107 operations; 7747.9 current ops/sec; est completion in 15 minutes [INSERT: Count=77481, Max=41919, Min=9240, Avg=12904.55, 90=14911, 99=32559, 99.9=40127, 99.99=41151] 
2018-12-28 15:30:26:655 380 sec: 2936736 operations; 7662.9 current ops/sec; est completion in 15 minutes [INSERT: Count=76627, Max=42335, Min=9728, Avg=13046.83, 90=13767, 99=28831, 99.9=39903, 99.99=41663] 
2018-12-28 15:30:36:655 390 sec: 3015387 operations; 7865.1 current ops/sec; est completion in 15 minutes [INSERT: Count=78652, Max=18399, Min=9248, Avg=12713.12, 90=13655, 99=14815, 99.9=16319, 99.99=17951] 
2018-12-28 15:30:46:655 400 sec: 3091987 operations; 7660 current ops/sec; est completion in 14 minutes [INSERT: Count=76598, Max=18175, Min=7968, Avg=13052.93, 90=13759, 99=14607, 99.9=16111, 99.99=16943] 
2018-12-28 15:30:56:655 410 sec: 3171942 operations; 7995.5 current ops/sec; est completion in 14 minutes [INSERT: Count=79958, Max=17887, Min=9032, Avg=12505.27, 90=14719, 99=15751, 99.9=16559, 99.99=17375] 
2018-12-28 15:31:06:655 420 sec: 3251047 operations; 7910.5 current ops/sec; est completion in 14 minutes [INSERT: Count=79107, Max=16703, Min=3950, Avg=12640.38, 90=13351, 99=14263, 99.9=15527, 99.99=16655] 
2018-12-28 15:31:16:655 430 sec: 3329927 operations; 7888 current ops/sec; est completion in 14 minutes [INSERT: Count=78875, Max=18543, Min=6004, Avg=12675.61, 90=13359, 99=15111, 99.9=16639, 99.99=17503] 
2018-12-28 15:31:26:655 440 sec: 3399155 operations; 6922.8 current ops/sec; est completion in 14 minutes [INSERT: Count=69229, Max=202239, Min=9920, Avg=14439.68, 90=15615, 99=52287, 99.9=155775, 99.99=159615] 
2018-12-28 15:31:36:655 450 sec: 3469946 operations; 7079.1 current ops/sec; est completion in 14 minutes [INSERT: Count=70790, Max=45631, Min=6788, Avg=14126.79, 90=16879, 99=35359, 99.9=42943, 99.99=44991] 
2018-12-28 15:31:46:655 460 sec: 3540890 operations; 7094.4 current ops/sec; est completion in 14 minutes [INSERT: Count=70945, Max=44031, Min=9568, Avg=14093.27, 90=15383, 99=35967, 99.9=42079, 99.99=43391] 
2018-12-28 15:31:56:655 470 sec: 3618467 operations; 7757.7 current ops/sec; est completion in 13 minutes [INSERT: Count=77575, Max=43263, Min=5612, Avg=12889.8, 90=14703, 99=34975, 99.9=41375, 99.99=42335] 
2018-12-28 15:32:06:655 480 sec: 3691273 operations; 7280.6 current ops/sec; est completion in 13 minutes [INSERT: Count=72809, Max=45119, Min=9208, Avg=13733.37, 90=15359, 99=34271, 99.9=40735, 99.99=43071] 
2018-12-28 15:32:16:655 490 sec: 3768350 operations; 7707.7 current ops/sec; est completion in 13 minutes [INSERT: Count=77075, Max=43807, Min=8408, Avg=12971.27, 90=15583, 99=34559, 99.9=40735, 99.99=43519] 
2018-12-28 15:32:26:655 500 sec: 3845867 operations; 7751.7 current ops/sec; est completion in 13 minutes [INSERT: Count=77518, Max=43167, Min=9128, Avg=12898.82, 90=14055, 99=33663, 99.9=40575, 99.99=42303] 
2018-12-28 15:32:36:655 510 sec: 3920366 operations; 7449.9 current ops/sec; est completion in 13 minutes [INSERT: Count=74501, Max=42431, Min=9416, Avg=13422.51, 90=16271, 99=31679, 99.9=40223, 99.99=41247] 
2018-12-28 15:32:46:655 520 sec: 3992979 operations; 7261.3 current ops/sec; est completion in 13 minutes [INSERT: Count=72612, Max=43263, Min=9904, Avg=13770.54, 90=15663, 99=31711, 99.9=40863, 99.99=42207] 
2018-12-28 15:32:56:655 530 sec: 4070675 operations; 7769.6 current ops/sec; est completion in 12 minutes [INSERT: Count=77693, Max=16479, Min=5644, Avg=12869.25, 90=13495, 99=14311, 99.9=15143, 99.99=16071] 
2018-12-28 15:33:06:655 540 sec: 4147216 operations; 7654.1 current ops/sec; est completion in 12 minutes [INSERT: Count=76542, Max=20911, Min=4680, Avg=13062.06, 90=13751, 99=15167, 99.9=18639, 99.99=19983] 
2018-12-28 15:33:16:655 550 sec: 4223695 operations; 7647.9 current ops/sec; est completion in 12 minutes [INSERT: Count=76481, Max=31631, Min=9312, Avg=13072.13, 90=14143, 99=16295, 99.9=24671, 99.99=26207] 
2018-12-28 15:33:26:655 560 sec: 4296789 operations; 7309.4 current ops/sec; est completion in 12 minutes [INSERT: Count=73091, Max=21311, Min=10720, Avg=13680.31, 90=15231, 99=17407, 99.9=19247, 99.99=20815] 
2018-12-28 15:33:36:655 570 sec: 4371948 operations; 7515.9 current ops/sec; est completion in 12 minutes [INSERT: Count=75161, Max=17487, Min=6520, Avg=13303.37, 90=14639, 99=15975, 99.9=16847, 99.99=17279] 
2018-12-28 15:33:46:655 580 sec: 4435912 operations; 6396.4 current ops/sec; est completion in 12 minutes [INSERT: Count=63962, Max=346879, Min=10056, Avg=15630.02, 90=17663, 99=56927, 99.9=232447, 99.99=329471] 
2018-12-28 15:33:56:655 590 sec: 4498544 operations; 6263.2 current ops/sec; est completion in 12 minutes [INSERT: Count=62634, Max=46591, Min=10816, Avg=15967.11, 90=18047, 99=39679, 99.9=44159, 99.99=46047] 
2018-12-28 15:34:06:655 600 sec: 4570442 operations; 7189.8 current ops/sec; est completion in 11 minutes [INSERT: Count=71898, Max=45823, Min=10192, Avg=13903.95, 90=16591, 99=36831, 99.9=42655, 99.99=44351] 
2018-12-28 15:34:16:655 610 sec: 4637138 operations; 6669.6 current ops/sec; est completion in 11 minutes [INSERT: Count=66695, Max=44575, Min=10552, Avg=14994.35, 90=17167, 99=37151, 99.9=42591, 99.99=43839] 
2018-12-28 15:34:26:655 620 sec: 4702850 operations; 6571.2 current ops/sec; est completion in 11 minutes [INSERT: Count=65714, Max=44895, Min=9664, Avg=15214.33, 90=17055, 99=37695, 99.9=43871, 99.99=44447] 
2018-12-28 15:34:36:655 630 sec: 4771183 operations; 6833.3 current ops/sec; est completion in 11 minutes [INSERT: Count=68330, Max=213631, Min=5976, Avg=14607, 90=16431, 99=51135, 99.9=157055, 99.99=205311] 
2018-12-28 15:34:46:655 640 sec: 4828832 operations; 5764.9 current ops/sec; est completion in 11 minutes [INSERT: Count=57649, Max=96895, Min=10496, Avg=17378.26, 90=21407, 99=53855, 99.9=75839, 99.99=78655] 
2018-12-28 15:34:56:655 650 sec: 4888519 operations; 5968.7 current ops/sec; est completion in 11 minutes [INSERT: Count=59689, Max=47871, Min=5288, Avg=16751.33, 90=20575, 99=38271, 99.9=45151, 99.99=46175] 
2018-12-28 15:35:06:655 660 sec: 4954642 operations; 6612.3 current ops/sec; est completion in 11 minutes [INSERT: Count=66121, Max=46399, Min=6204, Avg=15117.13, 90=16959, 99=37535, 99.9=42943, 99.99=45855] 
2018-12-28 15:35:16:655 670 sec: 5025075 operations; 7043.3 current ops/sec; est completion in 11 minutes [INSERT: Count=70434, Max=43487, Min=10104, Avg=14197.13, 90=16231, 99=35647, 99.9=41183, 99.99=42431] 
2018-12-28 15:35:26:655 680 sec: 5091084 operations; 6600.9 current ops/sec; est completion in 10 minutes [INSERT: Count=66008, Max=49887, Min=7480, Avg=15143.5, 90=16943, 99=36127, 99.9=43455, 99.99=48575] 
2018-12-28 15:35:36:655 690 sec: 5168462 operations; 7737.8 current ops/sec; est completion in 10 minutes [INSERT: Count=77381, Max=44959, Min=6608, Avg=12924.53, 90=15951, 99=23983, 99.9=42111, 99.99=43455] 
2018-12-28 15:35:46:655 700 sec: 5253332 operations; 8487 current ops/sec; est completion in 10 minutes [INSERT: Count=84868, Max=18639, Min=6360, Avg=11785.21, 90=14823, 99=16087, 99.9=17183, 99.99=18415] 
2018-12-28 15:35:56:655 710 sec: 5340102 operations; 8677 current ops/sec; est completion in 10 minutes [INSERT: Count=86771, Max=19535, Min=9456, Avg=11522.87, 90=13967, 99=15695, 99.9=17151, 99.99=18287] 
2018-12-28 15:36:06:655 720 sec: 5424573 operations; 8447.1 current ops/sec; est completion in 10 minutes [INSERT: Count=84470, Max=18511, Min=9192, Avg=11835.97, 90=14039, 99=15399, 99.9=17071, 99.99=18207] 
2018-12-28 15:36:16:655 730 sec: 5506964 operations; 8239.1 current ops/sec; est completion in 9 minutes [INSERT: Count=82392, Max=18351, Min=9288, Avg=12137.18, 90=14895, 99=16087, 99.9=16991, 99.99=18095] 
2018-12-28 15:36:26:655 740 sec: 5598680 operations; 9171.6 current ops/sec; est completion in 9 minutes [INSERT: Count=91716, Max=17455, Min=9040, Avg=10898.98, 90=11655, 99=13735, 99.9=15319, 99.99=16239] 
2018-12-28 15:36:36:655 750 sec: 5670044 operations; 7136.4 current ops/sec; est completion in 9 minutes [INSERT: Count=71362, Max=223359, Min=9048, Avg=14011.29, 90=16831, 99=42495, 99.9=130623, 99.99=180351] 
2018-12-28 15:36:46:655 760 sec: 5737949 operations; 6790.5 current ops/sec; est completion in 9 minutes [INSERT: Count=67905, Max=45567, Min=6984, Avg=14725.87, 90=16359, 99=37919, 99.9=43103, 99.99=44895] 
2018-12-28 15:36:56:655 770 sec: 5811432 operations; 7348.3 current ops/sec; est completion in 9 minutes [INSERT: Count=73483, Max=44223, Min=6596, Avg=13604.2, 90=15535, 99=34399, 99.9=41855, 99.99=43743] 
2018-12-28 15:37:06:655 780 sec: 5885390 operations; 7395.8 current ops/sec; est completion in 9 minutes [INSERT: Count=73959, Max=45919, Min=4732, Avg=13521.55, 90=15335, 99=34623, 99.9=41151, 99.99=43647] 
2018-12-28 15:37:16:655 790 sec: 5951533 operations; 6614.3 current ops/sec; est completion in 8 minutes [INSERT: Count=66143, Max=49407, Min=6476, Avg=15113.11, 90=20191, 99=37471, 99.9=45855, 99.99=47263] 
2018-12-28 15:37:26:655 800 sec: 6024218 operations; 7268.5 current ops/sec; est completion in 8 minutes [INSERT: Count=72685, Max=45663, Min=9504, Avg=13759.12, 90=15751, 99=34303, 99.9=41823, 99.99=44767] 
2018-12-28 15:37:36:655 810 sec: 6101757 operations; 7753.9 current ops/sec; est completion in 8 minutes [INSERT: Count=77540, Max=42463, Min=7524, Avg=12895.47, 90=14535, 99=31551, 99.9=40479, 99.99=41151] 
2018-12-28 15:37:46:655 820 sec: 6173534 operations; 7177.7 current ops/sec; est completion in 8 minutes [INSERT: Count=71776, Max=47263, Min=7728, Avg=13926.58, 90=15943, 99=34751, 99.9=42975, 99.99=46271] 
2018-12-28 15:37:56:655 830 sec: 6243940 operations; 7040.6 current ops/sec; est completion in 8 minutes [INSERT: Count=70406, Max=45215, Min=8976, Avg=14205.79, 90=16527, 99=35039, 99.9=42335, 99.99=43807] 
2018-12-28 15:38:06:655 840 sec: 6321828 operations; 7788.8 current ops/sec; est completion in 8 minutes [INSERT: Count=77889, Max=43423, Min=9544, Avg=12837.58, 90=14127, 99=32527, 99.9=40255, 99.99=42239] 
2018-12-28 15:38:16:655 850 sec: 6399050 operations; 7722.2 current ops/sec; est completion in 7 minutes [INSERT: Count=77220, Max=43135, Min=9472, Avg=12947.78, 90=14055, 99=32927, 99.9=40479, 99.99=41983] 
2018-12-28 15:38:26:655 860 sec: 6466427 operations; 6737.7 current ops/sec; est completion in 7 minutes [INSERT: Count=67380, Max=45055, Min=5420, Avg=14839.85, 90=17103, 99=36991, 99.9=42495, 99.99=44319] 
2018-12-28 15:38:36:655 870 sec: 6541577 operations; 7515 current ops/sec; est completion in 7 minutes [INSERT: Count=75150, Max=44063, Min=7204, Avg=13305.23, 90=14855, 99=35103, 99.9=42015, 99.99=43455] 
2018-12-28 15:38:46:655 880 sec: 6621212 operations; 7963.5 current ops/sec; est completion in 7 minutes [INSERT: Count=79635, Max=42335, Min=5576, Avg=12554.84, 90=13983, 99=32927, 99.9=40255, 99.99=41631] 
2018-12-28 15:38:56:655 890 sec: 6702143 operations; 8093.1 current ops/sec; est completion in 7 minutes [INSERT: Count=80929, Max=18831, Min=9552, Avg=12355.75, 90=13383, 99=14447, 99.9=16295, 99.99=18063] 
2018-12-28 15:39:06:655 900 sec: 6778479 operations; 7633.6 current ops/sec; est completion in 7 minutes [INSERT: Count=76336, Max=19327, Min=9240, Avg=13096.6, 90=15031, 99=16255, 99.9=17871, 99.99=18431] 
2018-12-28 15:39:16:655 910 sec: 6860622 operations; 8214.3 current ops/sec; est completion in 6 minutes [INSERT: Count=82143, Max=18127, Min=9488, Avg=12171.81, 90=13151, 99=14239, 99.9=16071, 99.99=17519] 
2018-12-28 15:39:26:655 920 sec: 6941069 operations; 8044.7 current ops/sec; est completion in 6 minutes [INSERT: Count=80447, Max=18127, Min=7780, Avg=12429.58, 90=13247, 99=14183, 99.9=15999, 99.99=17791] 
2018-12-28 15:39:36:655 930 sec: 7020240 operations; 7917.1 current ops/sec; est completion in 6 minutes [INSERT: Count=79172, Max=26447, Min=9512, Avg=12628.6, 90=13935, 99=16231, 99.9=23263, 99.99=25711] 
2018-12-28 15:39:46:655 940 sec: 7096914 operations; 7667.4 current ops/sec; est completion in 6 minutes [INSERT: Count=76674, Max=252159, Min=7152, Avg=13014.28, 90=13279, 99=17439, 99.9=132735, 99.99=210815] 
2018-12-28 15:39:56:655 950 sec: 7159017 operations; 6210.3 current ops/sec; est completion in 6 minutes [INSERT: Count=62103, Max=93631, Min=6616, Avg=16127.87, 90=20239, 99=46367, 99.9=69951, 99.99=88383] 
2018-12-28 15:40:06:655 960 sec: 7226421 operations; 6740.4 current ops/sec; est completion in 6 minutes [INSERT: Count=67405, Max=45407, Min=10040, Avg=14837.09, 90=17775, 99=36575, 99.9=41695, 99.99=43999] 
2018-12-28 15:40:16:655 970 sec: 7290772 operations; 6435.1 current ops/sec; est completion in 6 minutes [INSERT: Count=64349, Max=49183, Min=8736, Avg=15538.85, 90=18111, 99=37695, 99.9=43519, 99.99=48863] 
2018-12-28 15:40:26:655 980 sec: 7358449 operations; 6767.7 current ops/sec; est completion in 5 minutes [INSERT: Count=67680, Max=44607, Min=5924, Avg=14773.8, 90=17503, 99=36255, 99.9=41951, 99.99=43263] 
2018-12-28 15:40:36:655 990 sec: 7425938 operations; 6748.9 current ops/sec; est completion in 5 minutes [INSERT: Count=67485, Max=46431, Min=9984, Avg=14819.35, 90=17263, 99=36287, 99.9=42751, 99.99=45023] 
2018-12-28 15:40:46:655 1000 sec: 7490762 operations; 6482.4 current ops/sec; est completion in 5 minutes [INSERT: Count=64824, Max=45791, Min=5292, Avg=15420.58, 90=18191, 99=36031, 99.9=42111, 99.99=44319] 
2018-12-28 15:40:56:655 1010 sec: 7559764 operations; 6900.2 current ops/sec; est completion in 5 minutes [INSERT: Count=69002, Max=45599, Min=9408, Avg=14473.29, 90=16927, 99=34623, 99.9=41503, 99.99=44735] 
2018-12-28 15:41:06:655 1020 sec: 7631840 operations; 7207.6 current ops/sec; est completion in 5 minutes [INSERT: Count=72077, Max=46751, Min=9920, Avg=13883.35, 90=16199, 99=34687, 99.9=42879, 99.99=46111] 
2018-12-28 15:41:16:655 1030 sec: 7701017 operations; 6917.7 current ops/sec; est completion in 5 minutes [INSERT: Count=69179, Max=44031, Min=9984, Avg=14459.95, 90=16943, 99=35743, 99.9=42111, 99.99=43327] 
2018-12-28 15:41:26:655 1040 sec: 7769539 operations; 6852.2 current ops/sec; est completion in 4 minutes [INSERT: Count=68521, Max=44031, Min=5240, Avg=14593.81, 90=16943, 99=35263, 99.9=40959, 99.99=42399] 
2018-12-28 15:41:36:655 1050 sec: 7841093 operations; 7155.4 current ops/sec; est completion in 4 minutes [INSERT: Count=71552, Max=45727, Min=6660, Avg=13953.69, 90=16911, 99=35583, 99.9=42271, 99.99=45567] 
2018-12-28 15:41:46:655 1060 sec: 7913697 operations; 7260.4 current ops/sec; est completion in 4 minutes [INSERT: Count=72605, Max=44767, Min=10544, Avg=13782.07, 90=16127, 99=36639, 99.9=41951, 99.99=43519] 
2018-12-28 15:41:56:655 1070 sec: 7985898 operations; 7220.1 current ops/sec; est completion in 4 minutes [INSERT: Count=72204, Max=46303, Min=10488, Avg=13857.34, 90=16767, 99=35679, 99.9=43551, 99.99=45311] 
2018-12-28 15:42:06:655 1080 sec: 8062478 operations; 7658 current ops/sec; est completion in 4 minutes [INSERT: Count=76576, Max=47135, Min=9448, Avg=13035.52, 90=14895, 99=35263, 99.9=42559, 99.99=44991] 
2018-12-28 15:42:16:655 1090 sec: 8135806 operations; 7332.8 current ops/sec; est completion in 4 minutes [INSERT: Count=73328, Max=44479, Min=10328, Avg=13658.22, 90=15967, 99=35871, 99.9=42431, 99.99=43455] 
2018-12-28 15:42:26:655 1100 sec: 8208362 operations; 7255.6 current ops/sec; est completion in 4 minutes [INSERT: Count=72557, Max=46399, Min=8840, Avg=13776.34, 90=16703, 99=35551, 99.9=42719, 99.99=44735] 
2018-12-28 15:42:36:655 1110 sec: 8279533 operations; 7117.1 current ops/sec; est completion in 3 minutes [INSERT: Count=71173, Max=49599, Min=10448, Avg=14053.03, 90=17295, 99=34143, 99.9=44319, 99.99=48671] 
2018-12-28 15:42:46:655 1120 sec: 8365800 operations; 8626.7 current ops/sec; est completion in 3 minutes [INSERT: Count=86268, Max=15647, Min=10128, Avg=11590.47, 90=12191, 99=13039, 99.9=14111, 99.99=14695] 
2018-12-28 15:42:56:655 1130 sec: 8445594 operations; 7979.4 current ops/sec; est completion in 3 minutes [INSERT: Count=79790, Max=45023, Min=10152, Avg=12530.35, 90=13959, 99=15703, 99.9=34975, 99.99=36351] 
2018-12-28 15:43:06:655 1140 sec: 8520869 operations; 7527.5 current ops/sec; est completion in 3 minutes [INSERT: Count=75279, Max=19599, Min=10656, Avg=13280.78, 90=14831, 99=16815, 99.9=18047, 99.99=19167] 
2018-12-28 15:43:16:655 1150 sec: 8600802 operations; 7993.3 current ops/sec; est completion in 3 minutes [INSERT: Count=79929, Max=18239, Min=10848, Avg=12511.01, 90=14039, 99=15679, 99.9=16703, 99.99=17855] 
2018-12-28 15:43:26:655 1160 sec: 8680139 operations; 7933.7 current ops/sec; est completion in 2 minutes [INSERT: Count=79337, Max=18015, Min=10584, Avg=12601.97, 90=13999, 99=15895, 99.9=17055, 99.99=17759] 
2018-12-28 15:43:36:655 1170 sec: 8751651 operations; 7151.2 current ops/sec; est completion in 2 minutes [INSERT: Count=71513, Max=333055, Min=10536, Avg=13960.36, 90=13743, 99=55263, 99.9=182655, 99.99=281855] 
2018-12-28 15:43:46:655 1180 sec: 8776570 operations; 2491.9 current ops/sec; est completion in 2 minutes [INSERT: Count=24919, Max=105791, Min=16344, Avg=40068.33, 90=65599, 99=86271, 99.9=100415, 99.99=105343] 
2018-12-28 15:43:56:655 1190 sec: 8799790 operations; 2322 current ops/sec; est completion in 2 minutes [INSERT: Count=23220, Max=95935, Min=17632, Avg=43170.71, 90=56447, 99=76031, 99.9=93823, 99.99=95679] 
2018-12-28 15:44:06:655 1200 sec: 8826926 operations; 2713.6 current ops/sec; est completion in 2 minutes [INSERT: Count=27135, Max=103999, Min=16232, Avg=36835.65, 90=53567, 99=79295, 99.9=91391, 99.99=100927] 
2018-12-28 15:44:16:655 1210 sec: 8853160 operations; 2623.4 current ops/sec; est completion in 2 minutes [INSERT: Count=26236, Max=98751, Min=14680, Avg=38133.78, 90=58879, 99=77375, 99.9=87807, 99.99=92351] 
2018-12-28 15:44:26:655 1220 sec: 8887291 operations; 3413.1 current ops/sec; est completion in 2 minutes [INSERT: Count=34129, Max=94719, Min=15136, Avg=29291.35, 90=51775, 99=74879, 99.9=89151, 99.99=93503] 
2018-12-28 15:44:36:655 1230 sec: 8925758 operations; 3846.7 current ops/sec; est completion in 2 minutes [INSERT: Count=38467, Max=95551, Min=12720, Avg=26001.22, 90=45663, 99=69247, 99.9=83647, 99.99=93759] 
2018-12-28 15:44:46:655 1240 sec: 8969844 operations; 4408.6 current ops/sec; est completion in 2 minutes [INSERT: Count=44086, Max=80255, Min=12864, Avg=22674.88, 90=38143, 99=56255, 99.9=65983, 99.99=77503] 
2018-12-28 15:44:56:655 1250 sec: 9013794 operations; 4395 current ops/sec; est completion in 2 minutes [INSERT: Count=43950, Max=85311, Min=13760, Avg=22758.38, 90=32959, 99=61247, 99.9=73407, 99.99=83327] 
2018-12-28 15:45:06:655 1260 sec: 9058184 operations; 4439 current ops/sec; est completion in 2 minutes [INSERT: Count=44390, Max=102271, Min=14416, Avg=22519.38, 90=28671, 99=63903, 99.9=84607, 99.99=93119] 
2018-12-28 15:45:16:655 1270 sec: 9108188 operations; 5000.4 current ops/sec; est completion in 2 minutes [INSERT: Count=50004, Max=67263, Min=12792, Avg=19985.09, 90=24703, 99=52063, 99.9=59295, 99.99=66815] 
2018-12-28 15:45:26:655 1280 sec: 9161258 operations; 5307 current ops/sec; est completion in 1 minute [INSERT: Count=53071, Max=64639, Min=9720, Avg=18855.01, 90=23407, 99=35263, 99.9=52543, 99.99=61983] 
2018-12-28 15:45:36:655 1290 sec: 9209679 operations; 4842.1 current ops/sec; est completion in 1 minute [INSERT: Count=48420, Max=66111, Min=12608, Avg=20654.2, 90=35487, 99=50751, 99.9=58111, 99.99=64639] 
2018-12-28 15:45:46:655 1300 sec: 9260639 operations; 5096 current ops/sec; est completion in 1 minute [INSERT: Count=50960, Max=53247, Min=11888, Avg=19602.05, 90=30959, 99=40831, 99.9=46911, 99.99=51583] 
2018-12-28 15:45:56:655 1310 sec: 9308749 operations; 4811 current ops/sec; est completion in 1 minute [INSERT: Count=48110, Max=134271, Min=13216, Avg=20799.47, 90=24655, 99=40703, 99.9=117439, 99.99=126015] 
2018-12-28 15:46:06:655 1320 sec: 9344778 operations; 3602.9 current ops/sec; est completion in 1 minute [INSERT: Count=36029, Max=454911, Min=10808, Avg=27747.62, 90=41407, 99=182399, 99.9=357119, 99.99=361727] 
2018-12-28 15:46:16:655 1330 sec: 9393192 operations; 4841.4 current ops/sec; est completion in 1 minute [INSERT: Count=48415, Max=48351, Min=16512, Avg=20650.56, 90=23455, 99=27759, 99.9=43487, 99.99=46911] 
2018-12-28 15:46:26:655 1340 sec: 9440181 operations; 4698.9 current ops/sec; est completion in 1 minute [INSERT: Count=46988, Max=51263, Min=15040, Avg=21273.28, 90=27951, 99=36543, 99.9=42303, 99.99=45567] 
2018-12-28 15:46:36:655 1350 sec: 9477443 operations; 3726.2 current ops/sec; est completion in 1 minute [INSERT: Count=37262, Max=311807, Min=11088, Avg=26494.12, 90=35391, 99=74559, 99.9=302847, 99.99=303871] 
2018-12-28 15:46:46:655 1360 sec: 9512289 operations; 3484.6 current ops/sec; est completion in 1 minute [INSERT: Count=34846, Max=425727, Min=15664, Avg=29083.17, 90=42175, 99=115839, 99.9=311039, 99.99=425215] 
2018-12-28 15:46:56:655 1370 sec: 9550088 operations; 3779.9 current ops/sec; est completion in 1 minute [INSERT: Count=37799, Max=423679, Min=11440, Avg=26443.17, 90=33119, 99=159487, 99.9=340735, 99.99=344831] 
2018-12-28 15:47:06:655 1380 sec: 9591774 operations; 4168.6 current ops/sec; est completion in 59 seconds [INSERT: Count=41686, Max=53183, Min=15400, Avg=23981.15, 90=31327, 99=37375, 99.9=46047, 99.99=52639] 
2018-12-28 15:47:16:655 1390 sec: 9631967 operations; 4019.3 current ops/sec; est completion in 54 seconds [INSERT: Count=40193, Max=434175, Min=11064, Avg=24886.63, 90=26479, 99=150399, 99.9=411135, 99.99=416767] 
2018-12-28 15:47:26:655 1400 sec: 9669528 operations; 3756.1 current ops/sec; est completion in 48 seconds [INSERT: Count=37562, Max=478463, Min=12192, Avg=26628.33, 90=32591, 99=215295, 99.9=461311, 99.99=467199] 
2018-12-28 15:47:36:655 1410 sec: 9699959 operations; 3043.1 current ops/sec; est completion in 44 seconds [INSERT: Count=30434, Max=909311, Min=10336, Avg=32836.45, 90=43039, 99=213759, 99.9=890367, 99.99=892415] 
2018-12-28 15:47:46:655 1420 sec: 9734791 operations; 3483.2 current ops/sec; est completion in 39 seconds [INSERT: Count=34831, Max=749055, Min=10640, Avg=28695.79, 90=35519, 99=220927, 99.9=716799, 99.99=721407] 
2018-12-28 15:47:56:655 1430 sec: 9774419 operations; 3962.8 current ops/sec; est completion in 34 seconds [INSERT: Count=39625, Max=338175, Min=15352, Avg=23464.83, 90=27647, 99=43071, 99.9=215679, 99.99=327423] 
2018-12-28 15:48:06:655 1440 sec: 9808254 operations; 3383.5 current ops/sec; est completion in 29 seconds [INSERT: Count=33835, Max=950271, Min=10792, Avg=31247.77, 90=36991, 99=280575, 99.9=946175, 99.99=949759] 
2018-12-28 15:48:16:655 1450 sec: 9842323 operations; 3406.9 current ops/sec; est completion in 24 seconds [INSERT: Count=34070, Max=885247, Min=12968, Avg=29744.46, 90=35103, 99=178175, 99.9=878079, 99.99=881663] 
2018-12-28 15:48:26:655 1460 sec: 9877713 operations; 3539 current ops/sec; est completion in 19 seconds [INSERT: Count=35391, Max=667135, Min=12152, Avg=28259.4, 90=35935, 99=179199, 99.9=627711, 99.99=629247] 
2018-12-28 15:48:36:655 1470 sec: 9903868 operations; 2615.5 current ops/sec; est completion in 15 seconds [INSERT: Count=26153, Max=1068031, Min=10952, Avg=38199.4, 90=49919, 99=313599, 99.9=1062911, 99.99=1063935] 
2018-12-28 15:48:46:655 1480 sec: 9948995 operations; 4512.7 current ops/sec; est completion in 8 second [INSERT: Count=45130, Max=1802239, Min=10536, Avg=22183.22, 90=25519, 99=80959, 99.9=1525759, 99.99=1801215] 
2018-12-28 15:48:56:655 1490 sec: 9986060 operations; 3706.5 current ops/sec; est completion in 3 second [INSERT: Count=37062, Max=1146879, Min=10112, Avg=25606.61, 90=27263, 99=307455, 99.9=1139711, 99.99=1144831] 
2018-12-28 15:48:59:785 1493 sec: 10000000 operations; 4453.67 current ops/sec; [CLEANUP: Count=100, Max=711, Min=13, Avg=27.13, 90=30, 99=41, 99.9=711, 99.99=711] [INSERT: Count=13940, Max=1559551, Min=1166, Avg=24915.58, 90=18911, 99=289023, 99.9=1558527, 99.99=1559551] 
[OVERALL], RunTime(ms), 1493130
[OVERALL], Throughput(ops/sec), 6697.340486092972
[TOTAL_GCS_PS_Scavenge], Count, 1646
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1003
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.06717432507551252
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1646
[TOTAL_GC_TIME], Time(ms), 1003
[TOTAL_GC_TIME_%], Time(%), 0.06717432507551252
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 27.13
[CLEANUP], MinLatency(us), 13
[CLEANUP], MaxLatency(us), 711
[CLEANUP], 95thPercentileLatency(us), 35
[CLEANUP], 99thPercentileLatency(us), 41
[INSERT], Operations, 10000000
[INSERT], AverageLatency(us), 14926.9456801
[INSERT], MinLatency(us), 959
[INSERT], MaxLatency(us), 1802239
[INSERT], 95thPercentileLatency(us), 24143
[INSERT], 99thPercentileLatency(us), 43583
[INSERT], Return=OK, 10000000